Конфигурация/Catalogs/НастройкиРасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>НастройкиРасчета</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Составляющие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Периодичность</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПериодичностьРасчетаВознагражденияУправляющего</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазаРасчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БазыРасчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрыРасчета</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/InformationRegisters/ДанныеКалендаря.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ДанныеКалендаря</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДня</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДнейКалендаря</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПереноса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Календарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ВидыРасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыРасчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РасчетДоходности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетВознагражденияУправляющего</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетПроцентнойСтавки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетРезервовПИФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетНадбавокИСкидокПаевыхИнвестиционныхФондов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ВидыПроцентныхПоказателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыПроцентныхПоказателей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КлючеваяСтавкаЦБРФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИПЦкДекабрюПредыдущегоГода</Name>
					<Comment>Индекс инфляции, CPI</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИПЦкКонцуПредыдущегоМесяца</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РостВВП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПремияЗаСубординированность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИПЦкСоответствующемуМесяцуПредыдущегоГода</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Catalogs/НастройкиРасчета/Ext/ManagerModule.bsl
Функция СформироватьНаименование(РеквизитыНастройкиРасчета, ЗадействованныеРеквизиты = "") Экспорт
	
	ЗадействованныеРеквизиты = "Составляющие, ВалютаРасчета";
	
	Если РеквизитыНастройкиРасчета = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПредставлениеВалюты		  = ?(РеквизитыНастройкиРасчета.ВалютаРасчета = ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_Российский_рубль"), "", Строка(РеквизитыНастройкиРасчета.ВалютаРасчета));
	ПредставлениеСоставляющих = СтрСоединить(РеквизитыНастройкиРасчета.Составляющие.Выгрузить().ВыгрузитьКолонку("Представление"), " + ");		
	
	Наименование = ?(ПустаяСтрока(ПредставлениеВалюты), "", ПредставлениеВалюты + ": ") + ПредставлениеСоставляющих;
	
	Возврат Наименование;
	
КонецФункции

Функция Рассчитать(НастройкаРасчета, ПараметрыРасчета) Экспорт
	
	ПроцентнаяСтавка = 0;
	Период = НачалоДня(ПараметрыРасчета.Период);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ЗаполнитьТаблицуПроцентныхСтавок(НастройкаРасчета, Период, Период, Запрос.МенеджерВременныхТаблиц);
	
	Запрос.УстановитьПараметр("НастройкаРасчета", НастройкаРасчета);
	Запрос.УстановитьПараметр("Период", Период);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТаблицаПроцентныхСтавок.ПроцентнаяСтавка КАК ПроцентнаяСтавка
		|ИЗ
		|	_ТаблицаПроцентныхСтавок КАК _ТаблицаПроцентныхСтавок
		|ГДЕ
		|	_ТаблицаПроцентныхСтавок.НастройкаРасчета = &НастройкаРасчета
		|	И _ТаблицаПроцентныхСтавок.Дата = &Период";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПроцентнаяСтавка = Выборка.ПроцентнаяСтавка;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПроцентнаяСтавка) Тогда
		ВызватьИсключение СтрШаблон("Не удалось рассчитать процентную ставку по настройке расчёта %1 на %2", НастройкаРасчета, Формат(ПараметрыРасчета.Период, "ДФ=dd.MM.yyyy"));
	КонецЕсли;

	Возврат ПроцентнаяСтавка;
	
КонецФункции

Процедура ЗаполнитьТаблицуПроцентныхСтавок(НастройкиРасчета, ДатаНачала, ДатаОкончания, МенеджерВременныхТаблиц) Экспорт
	
	МассивДоступныхВидовРасчета = Новый Массив;
	МассивДоступныхВидовРасчета.Добавить(Перечисления.ВидыРасчета.РасчетПроцентнойСтавки);
	МассивДоступныхВидовРасчета.Добавить(Перечисления.ВидыРасчета.РасчетРезервовПИФ);
	
	ИменаВременныхТаблиц = СистемныеФункции.ПолучитьИменаВременныхТаблицЗапроса(МенеджерВременныхТаблиц);
	ИменаВременныхТаблиц.Добавить("_ТаблицаПроцентныхСтавок");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("НастройкиРасчета",	НастройкиРасчета);
	Запрос.УстановитьПараметр("ДатаНачала", 		ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 		ДатаОкончания);
	
#Область ТекстЗапроса_НастройкиРасчета 
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиРасчетаСоставляющие.Ссылка КАК НастройкаРасчета,
		|	НастройкиРасчетаСоставляющие.Ссылка.ВидРасчета КАК ВидРасчета,
		|	НастройкиРасчетаСоставляющие.БазаРасчета КАК БазаРасчета,
		|	НастройкиРасчетаСоставляющие.ПараметрыРасчета КАК ПараметрыРасчета
		|ИЗ
		|	Справочник.НастройкиРасчета.Составляющие КАК НастройкиРасчетаСоставляющие
		|ГДЕ
		|	НастройкиРасчетаСоставляющие.Ссылка В(&НастройкиРасчета)";
#КонецОбласти	
	
	ТаблицаНастройкиРасчета = Запрос.Выполнить().Выгрузить();
	ТаблицаНастройкиРасчета.Колонки.Добавить("БиржевойИндекс",	Новый ОписаниеТипов("СправочникСсылка.БиржевыеИндексы"));
	ТаблицаНастройкиРасчета.Колонки.Добавить("Ставка",			Новый ОписаниеТипов("Число"));
	ТаблицаНастройкиРасчета.Колонки.Добавить("Доля",			Новый ОписаниеТипов("Число"));
	
	Для Каждого Настройка Из ТаблицаНастройкиРасчета Цикл
		Если МассивДоступныхВидовРасчета.Найти(Настройка.ВидРасчета) = Неопределено Тогда
			ВызватьИсключение СтрШаблон("Для вида расчёта '%1' недоступно заполнение таблицы процентых ставок.", Настройка.ВидРасчета);
		КонецЕсли;
		
		ПараметрыРасчета = Настройка.ПараметрыРасчета.Получить();
		
		Если Настройка.БазаРасчета = Справочники.БазыРасчета.ФиксированнаяСтавка Тогда
			Настройка.Ставка = ПараметрыРасчета.ПараметрРасчетаСтавка;
			Настройка.Доля	 = 1;
			
		ИначеЕсли Настройка.БазаРасчета = Справочники.БазыРасчета.РасчетРезерваПИФОтСреднегодовойСЧА 
			Или Настройка.БазаРасчета = Справочники.БазыРасчета.РасчетРезерваПИФОтОднойДвенадцатойПоследнейСЧА Тогда
			
			Настройка.Ставка = ПараметрыРасчета.ПараметрРасчетаСтавка;
			Настройка.Доля	 = 1;
			
		ИначеЕсли Настройка.БазаРасчета = Справочники.БазыРасчета.БиржевойИндекс Тогда
			Настройка.БиржевойИндекс = ПараметрыРасчета.ПараметрРасчетаБиржевойИндекс;
			Настройка.Доля			 = ПараметрыРасчета.ПараметрРасчетаДоля / 100;
			
		ИначеЕсли Настройка.БазаРасчета = Справочники.БазыРасчета.КлючеваяСтавкаЦБРФ Тогда
			Настройка.Доля = ПараметрыРасчета.ПараметрРасчетаДоля / 100;
			
		Иначе
			ВызватьИсключение СтрШаблон("Для базы '%1' расчёт не реализован", Настройка.БазаРасчета);
	
	    КонецЕсли;
	КонецЦикла;
	
	ТаблицаНастройкиРасчета.Колонки.Удалить("ПараметрыРасчета");
	
	Запрос.УстановитьПараметр("ТаблицаНастройкиРасчета", ТаблицаНастройкиРасчета);

#Область ТекстЗапроса_ТаблицаПроцентныхСтавок
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиРасчета.НастройкаРасчета КАК НастройкаРасчета,
		|	НастройкиРасчета.БазаРасчета КАК БазаРасчета,
		|	ВЫРАЗИТЬ(НастройкиРасчета.БиржевойИндекс КАК Справочник.БиржевыеИндексы) КАК БиржевойИндекс,
		|	НастройкиРасчета.Доля КАК Доля,
		|	НастройкиРасчета.Ставка КАК Ставка
		|ПОМЕСТИТЬ _НастройкиРасчета
		|ИЗ
		|	&ТаблицаНастройкиРасчета КАК НастройкиРасчета
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	БиржевойИндекс
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеКалендаря.Дата КАК Дата
		|ПОМЕСТИТЬ _ДанныеКалендаря
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|	И ДанныеКалендаря.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_НастройкиРасчета.БиржевойИндекс КАК БиржевойИндекс,
		|	_ДанныеКалендаря.Дата КАК Дата
		|ПОМЕСТИТЬ _БиржевыеИндексыСДатами
		|ИЗ
		|	_НастройкиРасчета КАК _НастройкиРасчета,
		|	_ДанныеКалендаря КАК _ДанныеКалендаря
		|ГДЕ
		|	_НастройкиРасчета.БазаРасчета = ЗНАЧЕНИЕ(Справочник.БазыРасчета.БиржевойИндекс)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.БиржевойИндекс КАК БиржевойИндекс,
		|	ВложенныйЗапрос.Дата КАК Дата,
		|	ЗначенияБиржевыхИндексов.CLOSE КАК Значение
		|ПОМЕСТИТЬ _ЗначенияБиржевыхИндексов
		|ИЗ
		|	(ВЫБРАТЬ
		|		_БиржевыеИндексыСДатами.БиржевойИндекс КАК БиржевойИндекс,
		|		_БиржевыеИндексыСДатами.Дата КАК Дата,
		|		МАКСИМУМ(ЗначенияБиржевыхИндексов.Период) КАК ПериодЗначенияБиржевогоИндекса
		|	ИЗ
		|		_БиржевыеИндексыСДатами КАК _БиржевыеИндексыСДатами
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК ЗначенияБиржевыхИндексов
		|			ПО _БиржевыеИндексыСДатами.БиржевойИндекс = ЗначенияБиржевыхИндексов.БиржевойИндекс
		|				И _БиржевыеИндексыСДатами.Дата >= ЗначенияБиржевыхИндексов.Период
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_БиржевыеИндексыСДатами.БиржевойИндекс,
		|		_БиржевыеИндексыСДатами.Дата) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК ЗначенияБиржевыхИндексов
		|		ПО ВложенныйЗапрос.БиржевойИндекс = ЗначенияБиржевыхИндексов.БиржевойИндекс
		|			И ВложенныйЗапрос.ПериодЗначенияБиржевогоИндекса = ЗначенияБиржевыхИндексов.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Дата КАК Дата,
		|	ПроцентныеПоказатели.ЗначениеПоказателя КАК Значение
		|ПОМЕСТИТЬ _ЗначенияКлючевойСтавки
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ДанныеКалендаря.Дата КАК Дата,
		|		МАКСИМУМ(ПроцентныеПоказатели.ДатаЗначения) КАК ПериодКлючевойСтавки
		|	ИЗ
		|		_ДанныеКалендаря КАК _ДанныеКалендаря
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПроцентныеПоказатели.СрезПоследних(
		|					&ДатаОкончания,
		|					Показатель = ЗНАЧЕНИЕ(Перечисление.ВидыПроцентныхПоказателей.КлючеваяСтавкаЦБРФ)
		|						И Прогноз = ЛОЖЬ) КАК ПроцентныеПоказатели
		|			ПО _ДанныеКалендаря.Дата >= ПроцентныеПоказатели.ДатаЗначения
		|	ГДЕ
		|		ЗНАЧЕНИЕ(Справочник.БазыРасчета.КлючеваяСтавкаЦБРФ) В
		|				(ВЫБРАТЬ
		|					_НастройкиРасчета.БазаРасчета КАК БазаРасчета
		|				ИЗ
		|					_НастройкиРасчета КАК _НастройкиРасчета)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ДанныеКалендаря.Дата) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПроцентныеПоказатели.СрезПоследних(
		|				&ДатаОкончания,
		|				Показатель = ЗНАЧЕНИЕ(Перечисление.ВидыПроцентныхПоказателей.КлючеваяСтавкаЦБРФ)
		|					И Прогноз = ЛОЖЬ) КАК ПроцентныеПоказатели
		|		ПО ВложенныйЗапрос.ПериодКлючевойСтавки = ПроцентныеПоказатели.ДатаЗначения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_НастройкиРасчета.НастройкаРасчета КАК НастройкаРасчета,
		|	_ДанныеКалендаря.Дата КАК Дата,
		|	СУММА(ВЫБОР _НастройкиРасчета.БазаРасчета
		|			КОГДА ЗНАЧЕНИЕ(Справочник.БазыРасчета.КлючеваяСтавкаЦБРФ)
		|				ТОГДА _ЗначенияКлючевойСтавки.Значение
		|			КОГДА ЗНАЧЕНИЕ(Справочник.БазыРасчета.БиржевойИндекс)
		|				ТОГДА _ЗначенияБиржевыхИндексов.Значение
		|			КОГДА ЗНАЧЕНИЕ(Справочник.БазыРасчета.ФиксированнаяСтавка)
		|				ТОГДА _НастройкиРасчета.Ставка
		|			КОГДА ЗНАЧЕНИЕ(Справочник.БазыРасчета.РасчетРезерваПИФОтСреднегодовойСЧА)
		|				ТОГДА _НастройкиРасчета.Ставка
		|			КОГДА ЗНАЧЕНИЕ(Справочник.БазыРасчета.РасчетРезерваПИФОтОднойДвенадцатойПоследнейСЧА)
		|				ТОГДА _НастройкиРасчета.Ставка
		|		КОНЕЦ * _НастройкиРасчета.Доля) КАК ПроцентнаяСтавка
		|ПОМЕСТИТЬ _ТаблицаПроцентныхСтавок
		|ИЗ
		|	_НастройкиРасчета КАК _НастройкиРасчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДанныеКалендаря КАК _ДанныеКалендаря
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЗначенияБиржевыхИндексов КАК _ЗначенияБиржевыхИндексов
		|		ПО _НастройкиРасчета.БиржевойИндекс = _ЗначенияБиржевыхИндексов.БиржевойИндекс
		|			И (_ДанныеКалендаря.Дата = _ЗначенияБиржевыхИндексов.Дата)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЗначенияКлючевойСтавки КАК _ЗначенияКлючевойСтавки
		|		ПО (_НастройкиРасчета.БазаРасчета = ЗНАЧЕНИЕ(Справочник.БазыРасчета.КлючеваяСтавкаЦБРФ))
		|			И (_ДанныеКалендаря.Дата = _ЗначенияКлючевойСтавки.Дата)
		|
		|СГРУППИРОВАТЬ ПО
		|	_НастройкиРасчета.НастройкаРасчета,
		|	_ДанныеКалендаря.Дата";
#КонецОбласти	

	Запрос.Выполнить();
	
	СистемныеФункции.УдалитьТаблицыИзМенеджераВременныхТаблиц(МенеджерВременныхТаблиц,, ИменаВременныхТаблиц); 
	
КонецПроцедуры

Функция НастройкаРасчетаРезерваПИФСодержитСтавку(НастройкаРасчета) Экспорт
	
	Если Не ЗначениеЗаполнено(НастройкаРасчета) 
		Или ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкаРасчета, "ВидРасчета") <> Перечисления.ВидыРасчета.РасчетРезервовПИФ 
		Или НастройкаРасчета.Составляющие.Количество() > 1 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	БазаРасчета = НастройкаРасчета.Составляющие[0].БазаРасчета;
	
	Возврат БазаРасчета = Справочники.БазыРасчета.РасчетРезерваПИФОтСреднегодовойСЧА
				Или БазаРасчета = Справочники.БазыРасчета.РасчетРезерваПИФОтОднойДвенадцатойПоследнейСЧА;
	
КонецФункции
